{
  "resourceType": "Questionnaire",
  "id": "qs1",
  "identifier": [
    {
      "system": "urn:ietf:rfc:3986"
    }
  ],
  "status": "draft",
  "date": "2015-03-23T23:56:59+00:00",
  "publisher": "HL7 FHIR Project (FHIR Management Group)",
  "group": {
    "extension": [
      {
        "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
        "valueString": "A resource that includes narrative, extensions, and contained resources."
      }
    ],
    "linkId": "DomainResource",
    "title": "A resource with narrative, extensions, and contained resources",
    "required": true,
    "repeats": false,
    "group": [
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "The logical id of the resource, as used in the url for the resoure. Once assigned, this value never changes. The only time that a resource does not have an id is when it is being submitted to the server using a create operation. Bundles always have an id, though it is usually a generated UUID."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "string"
          }
        ],
        "linkId": "DomainResource.id",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "DomainResource.id.value",
            "text": "Logical id of this artefact",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content may not always be associated with version changes to the resource."
          }
        ],
        "linkId": "DomainResource.meta",
        "text": "Metadata about the resource",
        "required": false,
        "repeats": true
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Asserting this rule set restricts the content to be only understood by a limited set of trading partners. This inherently limits the usefulness of the data in the long term. However the existing health eco-system is highly fractured, and not yet ready to define, collect, and exchange data in a generally computable sense. Wherever possible, implementers and/or specification writers should avoid using this element as much as possible."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "uri"
          }
        ],
        "linkId": "DomainResource.implicitRules",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "DomainResource.implicitRules.value",
            "text": "A set of rules under which this content was created",
            "type": "string",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "The base language in which the resource is written. Language is provided to support indexing and accessibility (typically, services such as text to speech use the language tag). The html language tag in the narrative applies  to the narrative. The language tag on the resource may be used to specify the language of other presentations generated from the data in the resource\n\nNot all the content has to be in the base language. The Resource.language should not be assumed to apply to the narrative automatically. If a language is specified, it should it also be specified on the div element in the html (see rules in HTML5 for information about the relationship between xml:lang and the html lang attribute)."
          },
          {
            "url": "http://www.healthintersections.com.au/fhir/Profile/metadata#type",
            "valueString": "code"
          }
        ],
        "linkId": "DomainResource.language",
        "required": false,
        "repeats": true,
        "question": [
          {
            "linkId": "DomainResource.language.value",
            "text": "language",
            "type": "choice",
            "required": false,
            "repeats": false
          }
        ]
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "A human-readable narrative that contains a summary of the resource, and may be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety. Contained resources do not have narrative. Resources that are not contained SHOULD have a narrative."
          }
        ],
        "linkId": "DomainResource.text",
        "text": "Text summary of the resource, for human interpretation",
        "required": false,
        "repeats": true
      },
      {
        "extension": [
          {
            "url": "http://hl7.org/fhir/Profile/questionnaire-extensions#flyover",
            "valueString": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope. This should never be done when the content can be identified properly, as once identification is lost, it is extremely difficult (and context dependent) to restore it again."
          }
        ],
        "linkId": "DomainResource.contained",
        "text": "Contained, inline Resources",
        "required": false,
        "repeats": true
      }
    ]
  }
}